Tekla.Structures.Internal.ArcTools.ConstructArc(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Boolean)
Created with CoPilot
Reconstructs a Geometry3d.Arc from start/end points, a radius and a large-arc flag.
The drawing Arc only stores (StartPoint, EndPoint, Radius, IsLargeArc). To make the
round-trip test (Arc constructed from an existing Geometry3d.Arc then retrieved via
GetGeometricalArc) pass, we must reproduce the same circle side that the original
3-point constructor (start, end, pointOnArc) would have selected for typical input.
Convention adopted:
- We pick the center on the side opposite to the "stable perpendicular" (mid - perp*h),
because the original three-point test data (pointOnArc above a horizontal chord)
yields a center below the chord.
- We then build the arc using the (centerPoint, startPoint, normal, deltaAngle) constructor
for stability (avoids depending on a synthetic third point).
- The minor central angle is always the angle between the radial start/end directions.
If isLargeArc is true we use 2π - minorAngle.
- The normal direction is chosen so that rotating startDirection about normal by +deltaAngle
reaches endDirection. For the large arc we flip the normal (so rotation goes the other way).

Tekla.Structures.Internal.ArcTools.ConstructArc(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Constructs a geometry3d.Arc using start point, end point and center point.
Assumes startPoint and endPoint are given in clockwise order when viewed along the
plane normal defined by (startPoint - centerPoint) x (endPoint - centerPoint).
Produces the minor arc between the two points.
startPoint: Start point on the circle.
endPoint: End point on the circle (clockwise from start).
centerPoint: Center of the circle.
Returns: Arc instance defined by start, end and an internally computed point on the arc.
Throws System.ArgumentNullException: If any point is null.
Throws System.ArgumentException: If start/end are not equidistant from center or degenerate.